copies/advanced-fixtures/advfix.org
#+Title: Advanced py.test Fixtures
#+Author: Floris Bruynooghe
#+Email: flub@devork.be
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: toc:nil num:nil reveal_center:t
#+REVEAL_HLEVEL: 1
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_THEME: solarized
#+REVEAL_ROOT: ./reveal.js


* Introduction

Fixtures are powerful:
- Dependency Injection
- Isolated
- Composable

Assume you know:
- py.test
- basic fixtures

#+BEGIN_NOTES
- Been using and contributing to py.test for a few years
- Use at own risk
- Some patterns we use in ~70k source
- Some from pytest-django
- Some made up stuff
#+END_NOTES

* The Basics

You should know this:

#+BEGIN_SRC python
  import pytest
  
  @pytest.fixture
  def foo():
      return 42
  
  def test_foo(foo):
      assert foo == 42
  
   class TestBar:
  
      @pytest.fixture
      def bar(self, request):
          def fin():
              print('Teardown of fixture bar')
          request.addfinalizer(fin)
          return 7
  
      def test_bar(self, foo, bar):
          assert foo != bar
#+END_SRC

#+BEGIN_NOTES
- Dependency Injection!
- Hope you know this
- Andreas explained that this morning
#+END_NOTES

* Caching fixtures

Fixture decorator has scope argument:

#+BEGIN_SRC python
  @pytest.fixture(scope='session')
  def foo(request):
      print('session setup')
      def fin():
          print('session finalizer')
      request.addfinalizer(fin)
      return f
  
  @pytest.fixture(scope='function')  # default scope
  def bar(request):
      print('funtion setup')
      def fin():
          print('function finalizer')
      request.addfinalizer(fin)
      return b
  
  def test_one(foo, bar):
      pass
  
  def test_two(foo, bar):
      pass
#+END_SRC

#+BEGIN_NOTES
- Cached on scope automatically
#+END_NOTES

** Caching Fixtures

#+BEGIN_EXAMPLE
  $ py.test test_ex.py -s
  ========================== test session starts ==========================
  platform linux2 -- Python 2.7.6 -- py-1.4.20 -- pytest-2.5.2
  plugins: timeout, capturelog, xdist
  collected 2 items 
  
  test_ex.py session setup
  funtion setup
  .function finalizer
  function setup
  .function finalizer
  session finalizer

  ======================= 2 passed in 0.07 seconds ========================
  
  Process *pytest* finished
#+END_EXAMPLE

Available scopes: function, class, module, session

#+BEGIN_NOTES
- session only setup once
- fuction twice
- ~-s~ does not capture stdout
- Scopes: function, class, module, session
#+END_NOTES

* Interdependent fixtures

Fixture can use fixtures too:

#+BEGIN_SRC python
  @pytest.fixture(scope='session')
  def db_conn():
      return create_db_conn()
  
  @pytest.fixture(scope='module')
  def db_table(request, db_conn):
      table = create_table(db_conn, 'foo')
      def fin():
          drop_table(db_conn, table)
      request.addfinalizer(fin)
      return table
  
  def test_bar(db_table):
      pass
#+END_SRC

#+BEGIN_NOTES
- Fixtures can depend on each other
- Functional test example
- Request is just a built-in fixture
#+END_NOTES

* Skip/fail in fixture

Fixtures can trigger skipping/failing of all dependent tests:

#+BEGIN_SRC python
  @pytest.fixture(scope='session')
  def redis_client():
      servers = ['localhost', 'venera.clockhouse']
      for hostname in servers:
          try:
              return redis.StrictRedis(hostname)
          except redis.ConnectionError:
              continue
      else:
          pytest.skip('No Redis server found')
#+END_SRC

#+BEGIN_NOTES
- In 2.6 this will respect scope
- also pytest.fail()
- .fail() and .skip() just raise an exception
#+END_NOTES

