copies/advanced-fixtures/advfix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Advanced py.test Fixtures</title>
<meta name="author" content="(Floris Bruynooghe)"/>

<link rel="stylesheet" href="./reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="./reveal.js/css/theme/solarized.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Advanced py.test Fixtures</h1>
<h2>Floris Bruynooghe</h2>
<h2><a href="mailto:flub@devork.be">flub@devork.be</a></h2>
<h2></h2></section>


<section>
<section id="sec-1" >

<h2>Introduction</h2>
<p>
Fixtures are powerful:
</p>
<ul class="org-ul">
<li>Dependency Injection
</li>
<li>Isolated
</li>
<li>Composable
</li>
</ul>

<p>
Assume you know:
</p>
<ul class="org-ul">
<li>py.test
</li>
<li>basic fixtures
</li>
</ul>

<aside class="notes">
<ul class="org-ul">
<li>Been using and contributing to py.test for a few years
</li>
<li>Use at own risk
</li>
<li>Some patterns we use in ~70k source
</li>
<li>Some from pytest-django
</li>
<li>Some made up stuff
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-2" >

<h2>The Basics</h2>
<p>
You should know this:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> pytest

<span style="color: #b58900;">@pytest.fixture</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">foo</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> 42

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_foo</span>(foo):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> foo == 42

 <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">TestBar</span>:

<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #b58900;">@pytest.fixture</span>
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">bar</span>(<span style="color: #859900; font-weight: bold;">self</span>, request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">fin</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">'Teardown of fixture bar'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   request.addfinalizer(fin)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> 7

<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_bar</span>(<span style="color: #859900; font-weight: bold;">self</span>, foo, bar):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> foo != bar
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Dependency Injection!
</li>
<li>Hope you know this
</li>
<li>Andreas explained that this morning
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-3" >

<h2>Caching fixtures</h2>
<p>
Fixture decorator has scope argument:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.fixture</span>(scope=<span style="color: #2aa198;">'session'</span>)
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">foo</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">'session setup'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">fin</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">'session finalizer'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   request.addfinalizer(fin)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> f

<span style="color: #b58900;">@pytest.fixture</span>(scope=<span style="color: #2aa198;">'function'</span>)  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">default scope</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">bar</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">'funtion setup'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">fin</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">'function finalizer'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   request.addfinalizer(fin)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> b

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_one</span>(foo, bar):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">pass</span>

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_two</span>(foo, bar):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">pass</span>
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Cached on scope automatically
</li>
</ul>
</aside>

</section>
<section id="sec-3-1" >

<h3>Caching Fixtures</h3>
<pre class="example">
$ py.test test_ex.py -s
========================== test session starts ==========================
platform linux2 -- Python 2.7.6 -- py-1.4.20 -- pytest-2.5.2
plugins: timeout, capturelog, xdist
collected 2 items 

test_ex.py session setup
funtion setup
.function finalizer
function setup
.function finalizer
session finalizer

======================= 2 passed in 0.07 seconds ========================

Process *pytest* finished
</pre>

<p>
Available scopes: function, class, module, session
</p>

<aside class="notes">
<ul class="org-ul">
<li>session only setup once
</li>
<li>fuction twice
</li>
<li><code>-s</code> does not capture stdout
</li>
<li>Scopes: function, class, module, session
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-4" >

<h2>Interdependent fixtures</h2>
<p>
Fixture can use fixtures too:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.fixture</span>(scope=<span style="color: #2aa198;">'session'</span>)
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">db_conn</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> create_db_conn()

<span style="color: #b58900;">@pytest.fixture</span>(scope=<span style="color: #2aa198;">'module'</span>)
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">db_table</span>(request, db_conn):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #268bd2;">table</span> = create_table(db_conn, <span style="color: #2aa198;">'foo'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">fin</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   drop_table(db_conn, table)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   request.addfinalizer(fin)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> table

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_bar</span>(db_table):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">pass</span>
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Fixtures can depend on each other
</li>
<li>Functional test example
</li>
<li>Request is just a built-in fixture
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-5" >

<h2>Skip/fail in fixture</h2>
<p>
Fixtures can trigger skipping/failing of all dependent tests:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.fixture</span>(scope=<span style="color: #2aa198;">'session'</span>)
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">redis_client</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #268bd2;">servers</span> = [<span style="color: #2aa198;">'localhost'</span>, <span style="color: #2aa198;">'venera.clockhouse'</span>]
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">for</span> hostname <span style="color: #859900; font-weight: bold;">in</span> servers:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">try</span>:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> redis.StrictRedis(hostname)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">except</span> redis.ConnectionError:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">continue</span>
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   pytest.skip(<span style="color: #2aa198;">'No Redis server found'</span>)
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>In 2.6 this will respect scope
</li>
<li>also pytest.fail()
</li>
<li>.fail() and .skip() just raise an exception
</li>
</ul>
</aside>
</section>
</section>
