copies/advanced-fixtures/advfix.org
* Marks

Rember tests can be marked:

#+BEGIN_SRC python
  @pytest.mark.mymarker
  @pytest.mark.other_marker
  def test_something():
      pass
#+END_SRC

Run tests based on markers:

#+BEGIN_EXAMPLE
  $ py.test -m "not mymarker"
#+END_EXAMPLE

Make them strict:

#+BEGIN_EXAMPLE
  # pytest.ini
  [pytest]
  addopts = --strict
  markers =
      mymarker: a custom marker
#+END_EXAMPLE

#+BEGIN_NOTES
- mark a test
- run test from command line
- Can use ~--strict~ and 
#+END_NOTES

* Using Marks from Fixtures
  
#+BEGIN_SRC python
  @pytest.fixture
  def mongo_client(request):
      marker = request.node.get_marker('mongo_db')
      if not marker:
          db = 'TestDB'
      else:
          def apifun(db):
              return db
          db = apifun(*marker.args, **marker.kwargs)
      return pymongo.MongoClient('127.0.0.1/{}'.format(db))
  
  @pytest.mark.mongo_db('Users')
  def test_something(mongo_client):
      pass
#+END_SRC

#+BEGIN_NOTES
- Use a mark as a parameter to a fixture
- Maybe consider re-designing the fixture
- apifun current hack to get python argument parsing
#+END_NOTES

* Autouse fixtues

Setup/teardown without explicit request:

#+BEGIN_SRC python
  @pytest.mark.linux
  def test_mem_stack():
      assert MemSizes().stack == 42
  
  @pytest.fixture(autouse=True)
  def _platform_skip(request):
      marker = request.node.get_marker('linux')
      if marker and platform.system() != 'Linux':
          pytest.skip('N/A on {}'.format(platform.system()))
#+END_SRC

#+BEGIN_NOTES
- An autouse fixture to detect the mark
- Autouse fixture invoked before each test
- ~node.keywords~
- Autouse also useful without marks
#+END_NOTES

* Parametrising fixtures

- Individual fixtures can be paremeterised
- Multiple parameterised fixtures combine

#+BEGIN_SRC python
  @pytest.fixture(params=['ora', 'pg', 'sqlite'])
  def dburi(request):
      return create_db_uri(request.param)
  
  @pytest.fixture(params=['ipv4', 'ipv6'])
  def addr_family(request):
      return socket.AF_INET if request.param == 'ipv4' else socket.AF_INET6
  
  def test_txn(dburi):
      inst = MyObj(dburi)
      assert inst.transaction_works()
  
  def test_conn(dburi, addr_family):
      inst = MyObj(dburi, addr_family)
      assert inst.it_works()
#+END_SRC

#+BEGIN_NOTES
- Powerful, combinatory
- Functional test example
- This will execute 6 versions of test_func
#+END_NOTES

* Skipping Parameters

Skipping can be done on a parameter level:

#+BEGIN_SRC python
  try:
      import cx_Oracle as ora
  except ImportError:
      ora = None
  
  needs_ora = pytest.mark.skipif(ora is None, reason='No Oracle installed')
  
  @pytest.fixture(params=[
      'pg',
      needs_ora('ora'),
  ])
  def dburi(request):
      return create_db_uri(request.param)
#+END_SRC

#+BEGIN_NOTES
- Marks can be assigned to vars
#+END_NOTES

* Accessing Fixture Info

Find out what other fixtures are requested:

#+BEGIN_SRC python
  @pytest.fixture
  def db(request):
      if 'transactional_db' in request.fixturenames:
          pytest.fail('Conflicting fixtures')
      return no_transactions_db()
  
  @pytest.fixture
  def transactional_db(request):
      if 'db' in request.fixturenames:
          pytest.fail('Conflicting fixtures')
      return transactional_db()
#+END_SRC

#+BEGIN_NOTES
- Mutual exclusive fixture
#+END_NOTES

