copies/advanced-fixtures/advfix.html
<section>
<section id="sec-6" >

<h2>Marks</h2>
<p>
Rember tests can be marked:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.mark.mymarker</span>
<span style="color: #b58900;">@pytest.mark.other_marker</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_something</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">pass</span>
</pre>
</div>

<p>
Run tests based on markers:
</p>

<pre class="example">
$ py.test -m "not mymarker"
</pre>

<p>
Make them strict:
</p>

<pre class="example">
# pytest.ini
[pytest]
addopts = --strict
markers =
    mymarker: a custom marker
</pre>

<aside class="notes">
<ul class="org-ul">
<li>mark a test
</li>
<li>run test from command line
</li>
<li>Can use <code>--strict</code> and 
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-7" >

<h2>Using Marks from Fixtures</h2>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.fixture</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">mongo_client</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #268bd2;">marker</span> = request.node.get_marker(<span style="color: #2aa198;">'mongo_db'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900; font-weight: bold;">not</span> marker:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #268bd2;">db</span> = <span style="color: #2aa198;">'TestDB'</span>
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">apifun</span>(db):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> db
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #268bd2;">db</span> = apifun(*marker.args, **marker.kwargs)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> pymongo.MongoClient(<span style="color: #2aa198;">'127.0.0.1/{}'</span>.<span style="color: #657b83; font-weight: bold;">format</span>(db))

<span style="color: #b58900;">@pytest.mark.mongo_db</span>(<span style="color: #2aa198;">'Users'</span>)
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_something</span>(mongo_client):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">pass</span>
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Use a mark as a parameter to a fixture
</li>
<li>Maybe consider re-designing the fixture
</li>
<li>apifun current hack to get python argument parsing
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-8" >

<h2>Autouse fixtues</h2>
<p>
Setup/teardown without explicit request:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.mark.linux</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_mem_stack</span>():
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> MemSizes().stack == 42

<span style="color: #b58900;">@pytest.fixture</span>(autouse=<span style="color: #268bd2; font-weight: bold;">True</span>)
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">_platform_skip</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   marker = request.node.get_marker(<span style="color: #2aa198;">'linux'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> marker <span style="color: #859900; font-weight: bold;">and</span> platform.system() != <span style="color: #2aa198;">'Linux'</span>:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   pytest.skip(<span style="color: #2aa198;">'N/A on {}'</span>.<span style="color: #657b83; font-weight: bold;">format</span>(platform.system()))
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>An autouse fixture to detect the mark
</li>
<li>Autouse fixture invoked before each test
</li>
<li><code>node.keywords</code>
</li>
<li>Autouse also useful without marks
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-9" >

<h2>Parametrising fixtures</h2>
<ul class="org-ul">
<li>Individual fixtures can be paremeterised
</li>
<li>Multiple parameterised fixtures combine
</li>
</ul>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.fixture</span>(params=[<span style="color: #2aa198;">'ora'</span>, <span style="color: #2aa198;">'pg'</span>, <span style="color: #2aa198;">'sqlite'</span>])
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">dburi</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> create_db_uri(request.param)

<span style="color: #b58900;">@pytest.fixture</span>(params=[<span style="color: #2aa198;">'ipv4'</span>, <span style="color: #2aa198;">'ipv6'</span>])
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">addr_family</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> socket.AF_INET <span style="color: #859900; font-weight: bold;">if</span> request.param == <span style="color: #2aa198;">'ipv4'</span> <span style="color: #859900; font-weight: bold;">else</span> socket.AF_INET6

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_txn</span>(dburi):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   inst = MyObj(dburi)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> inst.transaction_works()

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">test_conn</span>(dburi, addr_family):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   inst = MyObj(dburi, addr_family)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> inst.it_works()
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Powerful, combinatory
</li>
<li>Functional test example
</li>
<li>This will execute 6 versions of test<sub>func</sub>
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-10" >

<h2>Skipping Parameters</h2>
<p>
Skipping can be done on a parameter level:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #859900; font-weight: bold;">try</span>:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">import</span> cx_Oracle <span style="color: #859900; font-weight: bold;">as</span> ora
<span style="color: #859900; font-weight: bold;">except</span> <span style="color: #b58900;">ImportError</span>:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #268bd2;">ora</span> = <span style="color: #268bd2; font-weight: bold;">None</span>

<span style="color: #268bd2;">needs_ora</span> = pytest.mark.skipif(ora <span style="color: #859900; font-weight: bold;">is</span> <span style="color: #268bd2; font-weight: bold;">None</span>, reason=<span style="color: #2aa198;">'No Oracle installed'</span>)

<span style="color: #b58900;">@pytest.fixture</span>(params=[
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #2aa198;">'pg'</span>,
<span style="color: #657b83; background-color: #eee8d5;"> </span>   needs_ora(<span style="color: #2aa198;">'ora'</span>),
])
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">dburi</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> create_db_uri(request.param)
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Marks can be assigned to vars
</li>
</ul>
</aside>
</section>
</section>
<section>
<section id="sec-11" >

<h2>Accessing Fixture Info</h2>
<p>
Find out what other fixtures are requested:
</p>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b58900;">@pytest.fixture</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">db</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">'transactional_db'</span> <span style="color: #859900; font-weight: bold;">in</span> request.fixturenames:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   pytest.fail(<span style="color: #2aa198;">'Conflicting fixtures'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> no_transactions_db()

<span style="color: #b58900;">@pytest.fixture</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">transactional_db</span>(request):
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">'db'</span> <span style="color: #859900; font-weight: bold;">in</span> request.fixturenames:
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #657b83; background-color: #eee8d5;"> </span>   pytest.fail(<span style="color: #2aa198;">'Conflicting fixtures'</span>)
<span style="color: #657b83; background-color: #eee8d5;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> transactional_db()
</pre>
</div>

<aside class="notes">
<ul class="org-ul">
<li>Mutual exclusive fixture
</li>
</ul>
</aside>
</section>
</section>
